# FormulaBasedParameterCannotBeChanged Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..FormulaBasedParameterCannotBeChanged Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Parameter '[Caption]' cannot be changed because it is defined by formula '[Formula]'
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FormulaBasedParameterCannotBeChanged { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FormulaBasedParameterCannotBeChanged As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FormulaBasedParameterCannotBeChanged {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace